# frozen_string_literal: true

# Git / GitHub
brew 'gh'
# brew 'git'
# brew 'git-gui'
brew 'git-lfs'
brew 'tig'
# brew 'act'

# AWS
cask 'aws-vault'
brew 'awscli'
brew 'aws-sso-util'

# Dev Tools
brew 'the_platinum_searcher'
# brew 'puma/puma/puma-dev'
# brew 'starship', args: ['HEAD']
brew 'mise'
brew 'tmux'
brew 'neovim'
brew 'direnv'
# brew 'localstack'
# brew 'adr-tools'
brew 'atuin'
brew 'devcontainer'
brew 'dive'

# Ruby Deps
brew 'libyaml'

# System Things
# brew 'artginzburg/tap/sudo-touchid', start_service: true
brew 'wget'
brew 'jq'

# K8s tools
brew 'argocd'
# brew 'eksctl'
brew 'helm'
brew 'k9s'
brew 'krew'
brew 'kubeseal'

# Terraform
# brew 'terraform-docs'
# brew 'tflint'
# brew 'terragrunt'
# brew  'tflint'
# brew  'tfsec'

# Lacework
# brew 'lacework/tap/lacework-cli'

# Spacelift
brew 'spacelift-io/spacelift/spacectl'

# Depenedencies
brew 'libpq'

cask 'notunes'

# brew 'common-fate/granted/granted'
