# frozen_string_literal: true

tap 'arkweid/lefthook'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'ouchxp/nodenv'
tap 'puma/puma'
brew 'awscli'
brew 'direnv'
brew 'gh'
# brew 'ghostscript'
brew 'git'
brew 'git-gui'
brew 'git-lfs'
brew 'gnupg', link: false
brew 'go'
# brew 'goreleaser'
brew 'imagemagick'
brew 'libgit2'
brew 'memcached', restart_service: true
brew 'neovim'
brew 'node'
brew 'node-build', args: ['HEAD']
brew 'nodenv'
brew 'tmux'
brew 'overmind'
# brew 'postgresql', restart_service: true
brew 'ruby-build'
brew 'rbenv'
# brew 'chruby'
brew 'redis', restart_service: true
# brew 'siege'
brew 'starship', args: ['HEAD']
brew 'terminal-notifier'
brew 'terraform-docs'
brew 'terraform@0.13', link: true
brew 'tflint'
brew 'the_platinum_searcher'
brew 'tig'
brew 'wget'
brew 'ykman'
brew 'arkweid/lefthook/lefthook'
brew 'heroku/brew/heroku'
brew 'ouchxp/nodenv/nodenv-nvmrc'
brew 'puma/puma/puma-dev'
cask 'another-redis-desktop-manager'
cask 'aws-vault'
cask 'brewservicesmenubar'
cask 'chromedriver'
cask 'gpg-suite'
cask 'secretive'
