# frozen_string_literal: true

# Git / GitHub
brew 'gh'
# brew 'git'
# brew 'git-gui'
brew 'git-lfs'
brew 'tig'
brew 'act'

# Node
# brew 'node'
# brew 'yarn'

# AWS
cask 'aws-vault'
brew 'awscli'

# Dev Tools
brew 'the_platinum_searcher'
# brew 'puma/puma/puma-dev'
# brew 'terminal-notifier'
brew 'starship', args: ['HEAD']
brew 'asdf', args: ['HEAD']
# brew 'overmind'
brew 'tmux'
brew 'neovim'
brew 'direnv'
# brew 'localstack'
brew 'adr-tools'
brew 'atuin'

# System Things
# brew 'artginzburg/tap/sudo-touchid', start_service: true
brew 'wget'
brew 'jq'

# K8s tools
brew 'argocd'
# brew 'eksctl'
brew 'helm'
brew 'k9s'
brew 'krew'
brew 'kubeseal'
# brew 'velero'

# Terraform
# brew 'terraform-docs'
# brew 'tflint'
# brew 'terragrunt'
# brew  'tflint'
# brew  'tfsec'

# Lacework
brew 'lacework/tap/lacework-cli'

# Depenedencies
brew 'libpq'
